Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཡན་ལག་དང་ཉིང་ལག་སློང་བ་ན་འདི་སྙམ་དུ། གལ་ཏེ་བདག་གིས་ཡན་ལག་དང་ཉིང་ལག་བྱིན་ན་ནི། ཡན་ལག་མེད་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: Lazy bodhisattvas are those who, when asked to give away their various body parts, think to themselves, ‘If I give away my body parts, I will no longer have any.’

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཡན་ལག་དང་ཉིང་ལག་ཡོངས་སུ་གཏོང་བ་ན་འདི་སྙམ་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་ཡན་ལག་གི་མཆོག་ཏུ་འགྱུར་རོ་སྙམ་དུ་སེམས་ཤིང་།
en: However, when bodhisattvas who are practicing diligence give away their body parts, they will tell themselves, ‘I shall take rebirth as a god, human, or asura in possession of perfect limbs. Moreover, I shall also receive the qualities of a buddha.’

source: དེ་ལྟར་རྩི་བས་འཇུག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Thinking like that, they will also act accordingly.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་སློང་བ་དག་སློང་བ་ན་འདི་སྙམ་དུ་བདག་ལ་སློང་བ་མང་ཆེས་ན་སློང་བ་འདི་དག་གི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་སུས་ནུས་སློང་བ་འདི་དག་གི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་ག་ལ་འགྱུར་སྙམ་དུ་དེ་ལྟར་སེམས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ། །གལ་ཏེ་འདི་སྙམ་དུ་སློང་བ་འདི་དག་ནི་མང་བ་མ་ཡིན་ཏེ།
en: Lazy bodhisattvas are those who, when approached by beggars, think, ‘There are so many beggars around me; how could I possibly give them what they ask for? Who could possibly satisfy them all?’ On the other hand, bodhisattva great beings who are practicing diligence will reason and think, ‘There are not too many beggars here.

source: འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་སློང་བ་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཉི་མ་གཅིག་ལ་འོངས་སུ་ཟིན་ཀྱང་དེ་ལྟར་ན་ཡང་མང་བ་མ་ཡིན་ནོ་སྙམ་དུ་སེམས་ཏེ།
en: Even if all the beggars in as many worlds as there are grains of sand in the Ganges were to arrive here on the same day, that would still not be too many.’

source: འདི་ལྟར་ཡང་དེའི་ཤེས་རབ་ཉེ་བར་གནས་པར་འགྱུར་ཞིང་། འདི་དག་ནི་ཉུང་སྟེ་གཞན་དག་ལ་ཡང་ཡང་དག་པར་ཀུན་བགེད་པ་སྤྲོའོ་ཞེས་དེ་སྙམ་དུ་སེམས་ཤིང་དེ་ལྟར་རྩི་བས་འཇུག་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: In this way their insight will increase and they will think, ‘There are not so many here. I would be happy if there were more,’ and thinking in this way, they would act accordingly.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པ་མངོན་པར་བསྒྲུབ་པར་བྱ་དགོས་ཏེ།
en: Because bodhisattvas have to accomplish the boundless qualities of a buddha.

source: བརྩོན་འགྲུས་དང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་གྲངས་ཆད་པས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པ་རྣམས་ཐོབ་པར་མི་ནུས་ཀྱི་གོ་ཆ་དཔག་ཏུ་མེད་པ་བགོས་པས་སངས་རྒྱས་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པ་རྣམས་ཐོབ་པར་ནུས་པའི་ཕྱིར་རོ།
en: If they limit their diligence and generosity, they will not be able to obtain the boundless qualities of a buddha. On the contrary, it is by forming a boundless resolve that bodhisattvas become able to obtain the boundless qualities of a buddha.

source: །དཔེར་ན་མི་ཞིག་རྒྱ་མཚོ་ཆེན་པོ་རྒལ་བར་འདོད་པར་གྱུར་ན་དེས་དཔག་ཚད་གཞན་དང་གཞན་སྟོང་ཕྲག་མང་པོར་གོ་ཆ་བགོ་བར་བྱ་དགོས་པ་དེ་བཞིན་དུ།
en: As an analogy, if a man intends to cross the great ocean, he must equip himself with a resolve that lasts for thousands of miles.

source: བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དཔག་ཏུ་མེད་པར་གོ་ཆ་བགོ་བར་བྱ་དགོས་སོ།
en: Likewise, if bodhisattvas wish to awaken to unsurpassed and perfect buddhahood, they must prepare themselves with a resolve that lasts for limitless billions of eons.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་བསྐལ་པ་གྲངས་མེད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་དུ་སེམས་ན། བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: Lazy bodhisattvas are those who think, ‘Within one countless eon I will awaken to unsurpassed and perfect buddhahood.’

source: །གལ་ཏེ་འདི་སྙམ་དུ་བསྐལ་པ་དཔག་ཏུ་མེད་པ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་དུ་སེམས་ན།
en: On the other hand, bodhisattva who are practicing diligence will think, ‘After boundless eons I will awaken to unsurpassed and perfect buddhahood.’

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་ཤིང་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Such bodhisattvas have formed a great resolve.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅི་བྱང་ཆུབ་སེམས་དཔའ་དཀའ་བ་བགྱིད་པ་ལགས་སམ་བཀའ་སྩལ་པ། གང་པོ་འདི་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའ་དཀའ་བ་ཅི་ཡང་མི་བྱེད་དམ།
en: Venerable Pūrṇa Maitrāyaṇīputra asked the Blessed One, “Blessed One, do bodhisattvas undergo hardships?” The Blessed One asked in return, “Pūrṇa, what do you think? Do bodhisattvas undergo any hardships?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ནི་དཀའ་བ་ཅི་ཡང་མི་བགྱིད་དོ། །
en: Venerable Pūrṇa replied, “No, Blessed One, bodhisattvas experience no hardships, because all phenomena are illusory, as you, Blessed One, have said.

source: ཆོས་ཐམས་ཅད་ནི་སྒྱུ་མ་ལྟ་བུར་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ཏེ། བདེ་བར་ཚོར་བ་གང་ལགས་པ་དང་། སྡུག་བསྔལ་བར་ཚོར་བ་གང་ལགས་པའི་ཆོས་འདི་གཉིས་ནི་སྒྱུ་མའི་ཆོས་ཉིད་ལས་འདས་པ་མ་ལགས་པའི་སླད་དུའོ།
en: Thus, all phenomena that involve feelings of pleasure or pain are merely illusory phenomena.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་རྣམ་གྲངས་འདིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཀའ་བ་བྱེད་པར་རིག་པར་བྱ་སྟེ།
en: The Blessed One said, “Pūrṇa, in this way, one should understand that bodhisattva great beings do undergo hardships.

source: སྒྱུ་མ་ལྟ་བུའི་ཆོས་རྣམས་ཀྱིས་སྤྲོ་ཞིང་། ལུས་སམ་སེམས་ཀྱིས་ཀྱང་ལེ་ལོར་མི་བྱེད་དེ།
en: They are delighted by illusory phenomena and avoid mental and physical laziness.

source: མངོན་པར་སྤྲོ་བར་བྱེད་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: This form of delight is also the bodhisattva great beings’ perfection of diligence.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཀའ་བ་བགྱིད་པ་ལགས་པར་རིག་པར་བགྱི་བ་ནི་ངོ་མཚར་ལགས་སོ།
en: Venerable Pūrṇa Maitrāyaṇīputra said to the Blessed One, “Blessed One, this understanding of how bodhisattva great beings undergo hardships is amazing!

source: །འདི་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་པར་གསུངས་ཏེ།
en: Blessed One, you have explained it so well!

source: གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་དཔག་ཏུ་མ་མཆིས་ཤིང་གྲངས་མ་མཆིས་པ་རྣམས་ཀྱི་མི་ཤེས་པ་སྤང་བའི་སླད་དུ་ཆོས་སྟོན་ལ་མི་ཤེས་པ་དེ་ཡང་སུའི་ཡང་མ་ལགས་ཏེ།
en: When someone awakens to unsurpassed and perfect buddhahood, they teach the Dharma in order to eradicate the ignorance of limitless and countless beings. However, that ignorance does not actually belong to anyone. ‘

source: བདག་ཅེས་བགྱི་བའམ། བདག་གི་ཞེས་བགྱི་བ་ནི་རང་གི་སེམས་ཀྱི་མི་ཤེས་པའི་བདག་ཏུ་འཛིན་པས་ཟིན་པའི་སེམས་ཅན་རྣམས་དེ་ལྟར་སེམས་པར་བས་སོ།
en: I’ and ‘mine’ are merely conceptualizations made by beings who cling to a personal self, due to their own ignorance.

source: །མི་ཤེས་པ་དེ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལགས་ཏེ། སུས་ཀྱང་མ་བསྐྱེད་ལགས་སོ།
en: This ignorance emerges in dependent origination; it is not created by anyone.

source: །རྒྱུ་ཚོགས་ཤིང་འདུས་པ་ལས་འབྱུང་ལ། རྒྱུ་མ་མཆིས་པར་གྱུར་པས་ནི་འགག་པར་འགྱུར་རོ།
en: It arises when its causes come together, and when the causes are no longer present, it will cease once again.

source: །ཆོས་རྣམས་ནི་རང་གི་ངང་གིས་འགག་པས་ན་སུས་ཀྱང་བཀག་པ་མ་མཆིས་སོ།
en: And since phenomena naturally come to an end by themselves, no one can terminate them.”

source: །བཀའ་སྩལ་པ། གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་རྩི་བས་འཇུག་ཅིང་དེ་ལས་སེམས་ཕྱིར་མི་ལྡོག་ན་དེ་ཉིད་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ཏེ།
en: The Blessed One said, “If bodhisattva great beings can reflect in this manner and apply it accordingly without changing their minds, then that is the perfection of diligence of bodhisattvas.

source: དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: As such, these are bodhisattvas who practice diligence.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་གལ་ཏེ་ཆོས་འདི་དག་སྟོང་པ་ཡིན་ན་ནི། བདག་གི་བརྩོན་འགྲུས་བརྩམས་པ་མཐུ་མེད་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: However, lazy bodhisattvas think, ‘If these phenomena are empty, my practice of diligence will lose its power.’

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་གང་གི་ཕྱིར་ཆོས་འདི་དག་སྟོང་པ་དེའི་ཕྱིར་སྟོང་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་སོ།
en: On the other hand, the perfection of diligence of bodhisattva great beings is to think, ‘It is because these phenomena are empty that I am able to awaken to unsurpassed and perfect buddhahood by means of emptiness.

source: འགྲོ་བ་ལྔའི་སེམས་ཅན་འདི་དག་ནི་སྟོང་པ་ཉིད་ཀྱིས་བཅིངས་པས་འཁོར་བ་ལས་མི་འདའ་སྟེ།
en: Because all beings within the five types of existence are bound by emptiness, which prevents them from passing beyond saṃsāra.

source: བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན་འགྲོ་བ་ལྔའི་སེམས་ཅན་འདི་དག་འཁོར་བ་ལས་རབ་ཏུ་རྣམ་པར་ཐར་བར་བྱ་བའི་ཕྱིར་ཆོས་བཤད་པར་བྱའོ།
en: However, when I awaken to unsurpassed and perfect buddhahood, I will teach the Dharma to these beings within the five types of existence, so that they can be freed from saṃsāra.

source: །རྒྱས་པར་རབ་ཏུ་བསྟན་པར་བྱའོ་སྙམ་དུ་སེམས་ན་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་པར་རིག་པར་བྱའོ། །གལ་ཏེ་དེ་འདི་སྙམ་དུ་འཁོར་བ་ཐོག་མ་དང་ཐ་མ་མེད་པ་འདིར་སུ་ཞིག་འཁོར་ཞིང་འདུག་སྟེ། བདག་ནི་སྤྲོ་བ་མེད་ཀྱིས་བདག་ནི་འདི་ཉིད་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱའོ་སྙམ་དུ་སེམས་ན། བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ། །
en: I will teach them extensively.’ “Lazy bodhisattvas will think, ‘If saṃsāra has neither beginning nor end, how could anyone be circling there? This leaves me no joy, so I will pass into nirvāṇa.’

source: གལ་ཏེ་དེ་འདི་སྙམ་དུ་བདག་ཇི་སྲིད་དུ་མཚམས་སྦྱར་ཅིང་འཁོར་བ་དེ་སྲིད་དུ། གཞན་དུ་ཡང་མཚམས་སྦྱར་ཞིང་འཁོར་བར་འགྱུར་ཏེ།
en: Rather than that, they should think, ‘As long as I take rebirth and circle in saṃsāra, for that long others will also transition and circle in saṃsāra.

source: དེ་ཡང་མཚམས་སྦྱར་ཞིང་འཁོར་བར་བྱ་དགོས་ལ།
en: So I will have to continue taking rebirth and circling in saṃsāra.

source: འོན་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་མི་འགྱུར་གྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་དུ་སེམས་ལ།
en: However, while they will not awaken to unsurpassed and perfect buddhahood, I will awaken to unsurpassed and perfect buddhahood.’

source: ཡང་དེ་འདི་སྙམ་དུ་ཇི་ལྟར་སེམས་བསྐྱེད་པ་འདི་ལྟར་འགྲོ་བ་བཞིན་དུ།
en: They may also think, ‘Actions follow after intentions.

source: ཉི་མ་ཡང་སེམས་བསྐྱེད་པ་ཙམ་དུ་སྣང་ངོ་སྙམ་དུ་སེམས་ཤིང་།
en: Even the sun appears through a mere wish.’

source: དེའི་ཡིད་ལ་བྱེད་པ་རྣམས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་ཏེ། དུས་ཚིགས་དང་། ལོ་དང་། ཟླ་བ་དང་། ཟླ་བ་ཕྱེད་པ་ཐམས་ཅད་འདའ་ཡང་མི་ཚོར་མི་ཤེས་ཏེ།
en: Those who think in this way will come to possess the state of omniscience and not even notice or realize the passing of the seasons, years, months, or fortnights.

source: འདི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཡོངས་སུ་དག་པར་བྱས་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཡོངས་སུ་དག་པར་བྱས་པས་དེའི་ཕྱིར་དུས་ཚིགས་དང་། ལོ་དང་། ཟླ་བ་དང་། ཟླ་བ་ཕྱེད་རྣམས་ཡིད་ལ་མི་སེམས་སོ། །
en: As they purify their minds by means of the perfections of generosity, discipline, patience, diligence, concentration, and insight, they do not notice or realize the passing of the seasons, years, months, or fortnights.

source: དཔེར་ན་ཚོང་དཔོན་ཞིག་གིས་འབུམ་ཕྲག་མང་པོ་རི་བའི་རིན་པོ་ཆེ་ཐོབ་ན། དེ་ཁྱིམ་གྱི་བྱ་བ་རྣམས་དང་། དེ་ལས་གཞན་པ་བུན་སྐྱིན་བཏང་བ་དང་། འདུ་བ་གང་ཅི་ཡང་རུང་བ་རྣམས་ཀྱང་ཡིད་ལ་མི་སེམས་སོ།
en: As an analogy, when a merchant obtains a jewel worth many hundreds of thousands of coins, he will forget all about his domestic chores, his finances, as well as any meetings he may have.

source: །གལ་ཏེ་འབུམ་ཕྲག་མང་པོ་རི་བའི་རིན་པོ་ཆེ་དེ་གདོད་ཐོབ་པར་འགྱུར་དུ་རེ་བ་ཞིག་ཡོད་ན་ནི་ཁ་ཟས་བཟའ་བའང་ཡིད་ལ་མེད་དོ།
en: If there is any chance that he can obtain that jewel worth so many hundreds of thousands of coins, he will even forget to eat.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱིས་སེམས་ཡོངས་སུ་དག་པར་གྱུར་པའང་། དུས་ཚིགས་དང་། ལོ་དང་། ཟླ་བ་དང་། ཟླ་བ་ཕྱེད་རྣམས་ཡིད་ལ་མི་བྱེད་དེ།
en: Likewise, as bodhisattvas purify their minds by means of the perfections, they have no concern for the passing of the seasons, years, months, or fortnights.

source: ནམ་ཞིག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རིན་པོ་ཆེ་ཐོབ་པར་འགྱུར་སྙམ་པ་འབའ་ཞིག་ཡིད་ལ་བྱེད་དོ། །
en: Instead, they will only think, ‘When will I attain the jewel of omniscience?’ ”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཡོན་ཏན་འདི་དག་ཡོངས་སུ་སྒྲོགས་པ་ནི་བརྩོན་འགྲུས་ཀྱི་གོ་ཆ་ཆེན་པོ་བགོས་པ་ལགས་སོ།
en: Venerable Pūrṇa said, “Blessed One, if bodhisattvas wish to proclaim all these qualities, they must have a strong armor of diligence.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་དེ་བཞིན་ཏེ།
en: The Blessed One said, “Pūrṇa, that is correct.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཡོན་ཏན་འདི་དག་ཡོངས་སུ་སྒྲོགས་པ་ནི་བརྩོན་འགྲུས་ཀྱི་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཡིན་ནོ།
en: Bodhisattva great beings who proclaim all these qualities have a strong armor of diligence.

source: །གང་པོ་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་ནང་ན། དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་འདི་དག་དང་ལྡན་པ་གང་ཡིན་པ་དང་། གང་ལ་ཡོན་ཏན་འདི་དག་ཡོད་པ་ངས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་།
en: Pūrṇa, within the world of gods, humans, and asuras, I do not see anyone who possesses these qualities of a bodhisattva or anyone in whom such qualities are present, apart from the Thus-Gone One.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་སྟན་ལས་ལངས་ཏེ། ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Venerable Pūrṇa Maitrāyaṇīputra rose up from his seat, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཚིག་ཏུ་སྨྲས་པ། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་དག་ན། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་གནས་པ་དེ་དག་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིག །
en: With his palms together he bowed toward the Blessed One, and supplicated, “Blessed One, in all of the boundless worlds in the eastern direction, may all bodhisattva great beings who have newly entered this vehicle reach the state of nonregression!

source: ཕྱིར་མི་ལྡོག་པ་གང་དག་ཡིན་པ་དེ་དག་ནི་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: And may all non-returning bodhisattva great beings swiftly perfect the state of omniscience!

source: དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་དང་། བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་དང་། དེ་བཞིན་དུ་ཕྱོགས་མཚམས་དང་ཕྱོགས་བཅུ་དག་ན་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་གནས་པ་དེ་དག་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིག ། ཕྱིར་མི་ལྡོག་པ་གང་དག་ཡིན་པ་དེ་དག་ནི།
en: Likewise, in the south, west, north, below, above, and in all the intermediate directions, may all bodhisattva great beings who have newly entered this vehicle reach the state of nonregression!

source: མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་ཚིག་ཏུ་སྨྲས་སོ།
en: And may all nonreturning bodhisattva great beings swiftly perfect the state of omniscience!”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གང་པོ་ཁྱོད་ཀྱིས་དོན་གྱི་དབང་གང་ཡང་དག་པར་མཐོང་བས་ཚིག་འདི་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་སྨྲས།
en: The Blessed One said to Venerable Pūrṇa Maitrāyaṇīputra, “Pūrṇa, it is because you understand the implications that you say, ‘May those bodhisattvas swiftly perfect the state of omniscience.’ ”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་མ་མཆིས་ན། འཇིག་རྟེན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འབྱུང་བར་མི་འགྱུར་ལ།
en: Venerable Pūrṇa said, “Honorable Blessed One, if there were no bodhisattvas, no buddhas would appear in the world.

source: སངས་རྒྱས་འབྱུང་བ་མ་མཆིས་ན། བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་མ་མཆིས་ཏེ།
en: And if no buddhas appear, there can be no saṅgha of the Blessed One’s hearers, nor can there be any bodhisattvas.

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཆིས་ན། འདི་ལྟར་འཇིག་རྟེན་དུ་སངས་རྒྱས་འབྱུང་བ་མཆིས་ལ།
en: Blessed One, therefore, if there are bodhisattva activities, the buddhas will appear in the world.

source: སངས་རྒྱས་འབྱུང་བ་མཆིས་ན། བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མཆིས་སོ།
en: If buddhas appear, the saṅgha of the Blessed One’s hearers can also appear, as can the bodhisattvas.

source: །བཅོམ་ལྡན་འདས་དཔེར་བགྱི་ན། ཤིང་ཆེན་པོ་སྡོང་པོ་དང་ལྡན་ཞིང་སྙིང་པོ་དང་ལྡན་ན། མེ་ཏོག་རྣམས་མཆིས་ལ། མེ་ཏོག་ལས་འབྲས་བུ་རྣམས་མཆིས་པར་གྱུར་ཏེ།
en: Blessed One, as an analogy, a tree that has a trunk with sap running through it can grow flowers, and from those flowers fruits can appear.

source: འབྲས་བུ་ལས་ཀྱང་ཤིང་ཆེན་པོ་འབྱུང་བར་འགྱུར་ལགས་སོ།
en: From those fruits other tall trees can grow.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་སངས་རྒྱས་བཞུགས་ན། ཉན་ཐོས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཆིས་ཏེ།
en: Blessed One, likewise, when a buddha is present, there can also be activities of the hearers and the bodhisattvas.

source: དེ་ལས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འབྱུང་བར་འགྱུར་ལགས་སོ།
en: From them the thus-gone, worthy, perfect buddhas will also appear.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་བཤད་པ་ལ་མངོན་པར་བསྟོད་དེ། གང་པོ་ལེགས་སོ། །ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ། །
en: At this point the Blessed One praised Venerable Pūrṇa Maitrāyaṇīputra’s comments: “Pūrṇa, excellent, excellent!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱིས་གོ་ཆ་ཆེན་པོ་བགོས་པ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟུང་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: He then said to Venerable Ānanda, “Ānanda, please remember and understand the perfection of diligence, which is for those bodhisattva great beings who wear a great armor of diligence.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: When the Blessed One had spoken, Venerable Pūrṇa Maitrāyaṇīputra, Venerable Śāradvatīputra, Venerable Ānanda, the entire retinue, and the world, including its gods, humans, asuras, and gandharvas, rejoiced and praised what the Blessed One had said.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྫོགས་སོ།། །།
en: This concludes “The Perfection of Diligence.”

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was staying in the Jeta Grove, Anāthapiṇḍada’s park at Śrāvastī, along with a great saṅgha of 1,250 monks.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: At that time Venerable Śāradvatīputra asked the Blessed One, “Blessed One, when bodhisattva great beings strive to awaken to unsurpassed and perfect buddhahood, how should they train in the perfection of concentration?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒོམ་པར་བགྱི།
en: Blessed One, how should they practice the perfection of concentration?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་བསམ་གཏན་དང་པོ་ལ་མཉམ་པར་འཇོག་པ་ན། འདི་ལྟར་བསམ་གཏན་འདི་ལ་བདག་གིས་སྔོན་ཡང་སྙོམས་པར་ཞུགས་ཏེ། བསམ་གཏན་དང་པོ་འདི་ལ་སྔོན་འཁོར་བ་ཐོག་མ་དང་ཐ་མ་མེད་པའི་སྐྱེ་བར་སྙོམས་པར་ཞུགས་སོ་སྙམ་དུ་མཉམ་པར་གཞག་པར་མི་བྱའི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྟེན་དུ་འགྱུར་རོ།
en: The Blessed One said to Venerable Śāradvatīputra, “Śāradvatīputra, when bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood rest evenly in the first concentration, they should think to themselves, ‘Previously I have also rested in this concentration, and as I rested in this first concentration, I nevertheless took birth in saṃsāra, which is without beginning or end.’ Contemplating in this manner, they should refrain from resting in this equipoise and instead use it as a basis for awakening to unsurpassed and perfect buddhahood.

source: །དེ་བཞིན་དུ་བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་ལ་མཉམ་པར་འཇོག་པ་ན། འདི་ལྟར་བསམ་གཏན་བཞི་པ་འདི་ལ་བདག་གིས་སྔོན་ཡང་སྙོམས་པར་ཞུགས་ཏེ། བསམ་གཏན་བཞི་པ་འདི་ལ་སྔོན་འཁོར་བ་ཐོག་མ་དང་ཐ་མ་མེད་པའི་སྐྱེ་བར་སྙོམས་པར་ཞུགས་ཏེ།
en: Likewise, when resting evenly in the second, third, and fourth concentrations, those bodhisattvas should think, ‘In the past I likewise rested in this concentration and, although I did so, I nevertheless took birth in saṃsāra, which is without beginning or end.

source: སྔོན་ཡང་བདག་གིས་བསམ་གཏན་འདི་དག་བསྐྱེད་དོ་སྙམ་དུ་མཉམ་པར་གཞག་པར་མི་བྱའི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ལ་ཕན་འདོགས་པར་འགྱུར་ཞིང་བསམ་གཏན་བཞི་པ་ལ་བརྟེན་ནས། མངོན་པར་ཤེས་པ་ལྔ་མངོན་པར་བསྒྲུབ་པར་བྱ་དགོས་ཏེ།
en: In the past I already developed these concentrations.’ As they consider this, they should avoid resting in these concentrations and instead utilize them for awakening to unsurpassed and perfect buddhahood. Based on the fourth concentration, they must then accomplish the five superknowledges. “

source: བྱང་ཆུབ་སེམས་དཔའ་སྔ་མ་རྣམས་ཀྱིས་ཀྱང་འདི་ལྟར་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མཉམ་པར་བཞག་ཅིང་བསྒོམས་ཏེ། དེ་བས་ན་བདག་གིས་ཀྱང་འདི་ལ་བསླབ་པར་བྱའོ།
en: Furthermore, bodhisattvas should think, ‘Just as the bodhisattvas of the past trained by resting evenly in the perfection of concentration, so I will also train now.’

source: །བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པར་འདོད་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་མངོན་པར་བསྒྲུབ་བོ།
en: When bodhisattvas wish in this way to practice the perfection of concentration, they must also accomplish the perfection of insight.

source: །ཤ་ར་དྭ་ཏིའི་བུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་བཞི་པ་ལ་གནས་པས་ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ནི་མཉམ་པར་གཞག་པར་མི་བྱའི། འདི་ནི་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་རྟེན་ཡིན་ནོ།
en: Śāradvatīputra, using the fourth concentration as a basis, bodhisattva great beings should not rest within it in order to actualize the exhaustion of defilements, but rather regard it as their foundation for attaining unsurpassed and perfect awakening.

source: །དེ་བསམ་གཏན་བཞི་པ་ལ་མཉམ་པར་འཇོག་པ་ན། བསམ་གཏན་རྣམས་དང་། བསམ་གཏན་གྱི་བདེ་བ་དང་། བསམ་གཏན་གྱི་རྒྱུ་འཐུན་པའི་རོ་མྱོང་བར་མི་བྱེད་དེ།
en: When bodhisattvas rest in the fourth concentration, they should never savor the experience of concentration, the bliss of concentration, or the related results of concentration.

source: འོན་ཀྱང་གནས་པ་དེས་གནས་པར་བྱེད་དོ།
en: Nevertheless, they should still use the concentration as a basis.

source: །དེ་བསམ་གཏན་བཞི་པ་ལ་གནས་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་ཅིང་མངོན་པར་སྒྲུབ་བོ། །
en: With the fourth concentration as a basis, they should rest evenly in the attainment of the field of limitless space and accomplish that state.
